Revit 2027 API
FamilyElementVisibility.IsShownOnlyWhenCut Property
Indicates if the instance is displayed only if it has been cut.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShownOnlyWhenCut { get; set; }
Public Property IsShownOnlyWhenCut As Boolean
	Get
	Set
public:
property bool IsShownOnlyWhenCut {
	bool get ();
	void set (bool value);
}
member IsShownOnlyWhenCut : bool with get, set
Property Value
Boolean
Remarks
This property matters for objects which visibility type is ViewSpecific.
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace